/*************************************************************************
	> File Name: EP06.c
	> Author: 
	> Mail: 
	> Created Time: 2019年02月19日 星期二 20时27分21秒
 ************************************************************************/

#include<stdio.h>

int main(){
    
   /* long num_1 = 0, num_2 = 0, num_3 = 0;
    
    for(int i = 1; i <= 100; i++){
       
        num_1 += i * i;

    }

    num_2 = (1 + 100) * 50;

    num_3 = num_2 * num_2;
    
    printf("%ld\n", num_3 - num_1);*/
    
    int sum1 = 0, sum2 = 0;

    sum2 = 5050;

    sum1 = (2 * 100 * 100 * 100 + 3 * (1 + 100) * 100 - 2 * 100) / 6;
    
    printf("%d\n", sum2 * sum2 - sum1);
   
    return 0;

}
