/*************************************************************************
	> File Name: EP31.1.c
	> Author: 
	> Mail: 
	> Created Time: 2019年03月04日 星期一 15时15分05秒
 ************************************************************************/

//用记忆化做

#include<stdio.h>
#include<inttypes.h>

int32_t many[8] = {1, 2, 5, 10, 20, 50, 100, 200};
int32_t d[205] = {0};

int32_t main() {
    d[0] = 1;
    for(int32_t i = 0; i < 8; i++)
        for(int32_t j = 0; j <= 200; j++)
            d[j + many[i]] += d[j];
    printf("%d\n", d[200]);
    return 0;
}
