/*************************************************************************
	> File Name: 4.偶数个3.c
	> Author: 
	> Mail: 
	> Created Time: 2019年10月25日 星期五 18时13分33秒
 ************************************************************************/

#include<stdio.h>
#define MAX_N 1000

long long arr[MAX_N + 5][2];

int main() {
    int n;
    scanf("%d", &n);
    arr[1][0] = 8;
    arr[1][1] = 1;
    for (int i = 2; i <= n; i++) {
        arr[i][0] = ((arr[i - 1][0] * 9) % 12345) + (arr[i - 1][1] % 12345);
        arr[i][1] = (arr[i - 1][0] % 12345) + ((arr[i -1][1] * 9) % 12345);
    }
    printf("%lld\n", arr[n][0] % 12345);
    return 0;
}
